GrumpyOldPizza/arduino-STM32L4/cores/stm32l4/stm32l4_wiring_tone.c
/*
 * Copyright (c) 2016 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "Arduino.h"
#include "stm32l4_wiring_private.h"

static GPIO_TypeDef *toneGPIO = NULL;
static uint32_t     toneBit = 0x00000000;
static uint32_t     toneCount = 0;;

static stm32l4_timer_t stm32l4_tone;

static void tone_event_callback(void *context, uint32_t events)
{
    if (toneCount) {
	if (toneCount & 1) {
	    toneGPIO->BSRR = toneBit;
	} else {
	    toneGPIO->BRR = toneBit;
	}

	if (toneCount < 0xfffffffe) {
	    toneCount--;
	} else {
	    toneCount ^= 1;
	}
    } else {
	stm32l4_timer_stop(&stm32l4_tone);
	stm32l4_timer_disable(&stm32l4_tone);

	toneGPIO->BRR = toneBit;
	toneGPIO = NULL;
    }
}

void tone(uint32_t pin, uint32_t frequency, uint32_t duration)
{
    if (frequency == 0) {
	return;
    }

    if ( g_APinDescription[pin].GPIO == NULL ) {
	return ;
    }

    if (stm32l4_tone.state == TIMER_STATE_NONE) {
	stm32l4_timer_create(&stm32l4_tone, TIMER_INSTANCE_TIM7, STM32L4_TONE_IRQ_PRIORITY, 0);
    }

    GPIO_TypeDef *GPIO = (GPIO_TypeDef *)g_APinDescription[pin].GPIO;
    uint32_t bit = g_APinDescription[pin].bit;

    if ((toneGPIO != GPIO) || (toneBit != bit)) {
	if (toneGPIO) {
	    noTone(pin);
	}

	digitalWrite(pin, LOW);
	pinMode(pin, OUTPUT);
    }

    toneGPIO  = GPIO;
    toneBit   = bit;
    toneCount = (duration > 0 ? frequency * duration * 2 / 1000UL : 0xfffffffe);

    uint32_t modulus = (stm32l4_timer_clock(&stm32l4_tone) / frequency) / 2;
    uint32_t scale   = 1;

    while (modulus > 65536) {
	modulus /= 2;
	scale++;
    }

    stm32l4_timer_enable(&stm32l4_tone, scale -1, modulus -1, 0, tone_event_callback, NULL, TIMER_EVENT_PERIOD);
    stm32l4_timer_start(&stm32l4_tone, false);

    toneGPIO->BSRR = toneBit;
}

void noTone(uint32_t pin)
{
  stm32l4_timer_stop(&stm32l4_tone);
  stm32l4_timer_disable(&stm32l4_tone);

  digitalWrite(pin, LOW);

  toneGPIO = NULL;
}
